let stages = [
    {
        question: "Какой способ объявления переменной в современном JS является наиболее предпочтительным?",
        answers: [
            "var X",
            "let X",
            "int X",
            "undefined X"
        ],
        rightAnswer: 2
    },
    {
        question: "Какой оператор используется для создания экземпляра объекта в JS?",
        answers: [
            "init",
            "let",
            "new",
            "var"
        ],
        rightAnswer: 3
    },
    {
        question: "Для чего используется ключевое слово const?",
        answers: [
            "Для обявления константы",
            "Для ускорения работы с памятью",
            "Для обеспечения стабильности работы скриптов",
            "Для красоты"
        ],
        rightAnswer: 1
    },
    {
        question: "Почему необходимо переопределять прототип потомка родительским прототипом при реализации наследования объектов в стиле ES5?",
        answers: [
            "Для обеспечения совместимости с более ранними стандартами языка",
            "Для ускорения создания объекта в памяти",
            "Для обеспечения доступа к методам родительского объекта",
            "Для обеспечения инкапсуляции данных дочернего объекта"
        ],
        rightAnswer: 3
    },
    {
        question: "Какой метод должен обязательно реализовываться в объектах в стиле ES6?",
        answers: [
            "destructor",
            "init",
            "engineer",
            "constructor"
        ],
        rightAnswer: 4
    },
]
